{
    "entries": [
        {
            "name": "James and Pro Life Discussion",
            "date": "11/8/2023",
            "contents": [
                "Meet and greet with James",
                "Q1: How have you all been?",
                "Q1.1: Any stories from the past few weeks?",
                "Q2 Are we designed to be social creatures?",
                "From USCCB: 'Each and every human life has inherent dignity, and thus must be treated with the respect due to a human person.'",
                "Issue 1 was a big development of the past week, and obviously many people have many strong opinions on this topic.",
                "Lets start with a general question,",
                "Q3: Why should we be care about abortion?",
                "Scripture: Jeremiah 1:1-10: 'Before I formed you in the womb, I knew you'",
                "Scripture: Corinthians 6:19-20",
                "Golden Rule: Treat others the way you want to be treated",
                "Life is a good thing. It is that which all that we experience hinges from.",
                "Given the scientific fact that a human life begins at conception, the only moral norm needed to understand the Church's opposition to abortion is the principle that each and every human life has inherent dignity, and thus must be treated with the respect due to a human person.  This is the foundation for the Church's social doctrine, including its teachings on war, the use of capital punishment, euthanasia, health care, poverty and immigration.  Conversely, to claim that some live human beings do not deserve respect or should not be treated as 'persons' (based on changeable factors such as age, condition, location, or lack of mental or physical abilities) is to deny the very idea of inherent human rights.  Such a claim undermines respect for the lives of many vulnerable people before and after birth.",
                "Scripture: Genesis 1:27: God created mankind in his image;in the image of God he created them; male and female[a] he created them.",
                "Scripture: Matthew 25:31-40",
                "I have heard people say that this discussion on abortion is a waste of time compared to other issues the US/world is facing. Do you agree?",
                "Go into detail about friends groupchat"
            ],
            "links": [
                {
                    "text": "USCCB on Abortion",
                    "url": "https://www.usccb.org/issues-and-action/human-life-and-dignity/abortion/respect-for-unborn-human-life"
                }
            ]
        }
    ]
}