{
    "entries": [
        {
            "name": "James and Pro Life Discussion",
            "date": "11/8/2023",
            "contents": [
                "Meet and greet with James",
                "Q1: How have you all been?",
                "Q1.1: Any stories from the past few weeks?",
                "Q2 Are we designed to be social creatures?",
                "From USCCB: 'Each and every human life has inherent dignity, and thus must be treated with the respect due to a human person.'",
                "Issue 1 was a big development of the past week, and obviously many people have many strong opinions on this topic.",
                "Lets start with a general question,",
                "Q3: Why should we be care about abortion?",
                "Scripture: Jeremiah 1:1-10: 'Before I formed you in the womb, I knew you'",
                "Scripture: 1 Corinthians 6:19-20",
                "Golden Rule: Treat others the way you want to be treated",
                "Life is a good thing. It is that which all that we experience hinges from.",
                "Given the scientific fact that a human life begins at conception, the only moral norm needed to understand the Church's opposition to abortion is the principle that each and every human life has inherent dignity, and thus must be treated with the respect due to a human person.  This is the foundation for the Church's social doctrine, including its teachings on war, the use of capital punishment, euthanasia, health care, poverty and immigration.  Conversely, to claim that some live human beings do not deserve respect or should not be treated as 'persons' (based on changeable factors such as age, condition, location, or lack of mental or physical abilities) is to deny the very idea of inherent human rights.  Such a claim undermines respect for the lives of many vulnerable people before and after birth.",
                "Scripture: Genesis 1:27: God created mankind in his image;in the image of God he created them; male and female[a] he created them.",
                "Scripture: Matthew 25:31-40",
                "I have heard people say that this discussion on abortion is a waste of time compared to other issues the US/world is facing. Do you agree?",
                "Go into detail about friends groupchat"
            ],
            "links": [
                {
                    "text": "USCCB on Abortion",
                    "url": "https://www.usccb.org/issues-and-action/human-life-and-dignity/abortion/respect-for-unborn-human-life"
                },
                {
                    "text": "Fetal Development",
                    "url": "https://www.babycenter.com/pregnancy/your-baby/fetal-development-week-by-week_10406730"
                }
            ]
        },
        {
            "name": "Gratitude and the goodness of Creation",
            "date": "11/16/2023",
            "contents": [
                "Q1: What is 1 thing you have been greatful for this week? ",
                "Q1: What is something you should have been grateful for, but were not?",
                "Scripture: Wis 13:1-9",
                "Q: What do you idolize?",
                "Q: Where do you see God in the world?",
                "Scripture: 1 Timothy 4:4-5",
                "Read the rest of Timothy, it is interesting.",
                "asceticism: severe self-discipline and avoidance of all forms of indulgence, typically for religious reasons.",
                "Is sex a good thing? How about alcohol? How about the beauty of women? Should we deny ourselves things that are good?",
                "Everything in moderation? (NO)",
                "Q: Why do you idolize?",
                "Scripture: Colossians 1:16"
            
            ],
            "links": [
                {
                    "text": "Digression on False worship",
                    "url": "https://bible.usccb.org/bible/wisdom/13"
                },
                {
                    "text": "Reflection",
                    "url": "https://www.ncregister.com/blog/the-beauty-of-creation-reflects-the-beauty-of-the-creator"
                }
            ]
        },
        {
            "name": "Baptism",
            "date": "11/30/2023",
            "contents": [
                "Q1: What was something that inspired you this week?",
                "Q2: Who of you are baptised?",
                "Baptism of Jesus: Mark 1:1-13",
                "Q3: What followed baptism? (Hardship)",
                "Scripture: Mark 16:14-18, The call to be baptised",
                "Adult Catechism: The origin and foundation of Christian Baptism is Jesus.  Before starting his public ministry, Jesus submitted himself to the baptism given by John the Baptist.  The waters did not purify him; he cleansed the waters.  . . .  Jesus did not need to be baptized because he was totally faithful to the will of his Father and free from sin.  However, he wanted to show his solidarity with human beings in order to reconcile them to the Father. By commanding his disciples to baptize all nations, he established the means by which people would die to sin – Original and actual – and begin to live a new life with God.",
                "Scripture: Unity and Diversity in the Body: 1 Corinthians 12:12-26",
                "Scripture:  1 Corinthians 12:26-31",
                "Q4: Why do we baptise infants? S3 in my NABRE",
                "Is Baptism an end or a beginning?"
            ],
            "links": [
                {
                    "text": "Baptism (USCCB)",
                    "url": "https://www.usccb.org/prayer-and-worship/sacraments-and-sacramentals/baptism"
                },
                {
                    "text": "Reflection",
                    "url": "https://www.ncregister.com/blog/the-beauty-of-creation-reflects-the-beauty-of-the-creator"
                }
            ]
        },
        {
            "name": "What should we choose to focus on?",
            "date": "12/7/2023",
            "contents": [
                "Dependence on God: Matthew 6:25-34",
                "Duty to Live in the Light: Ephesians 5:6-20",
                "How do you decide what you should do during the day?",
                "What are the mandatory things vs the voluntary?",
                "A question to pose, what do you never regret doing?",
                "What if you regret the results but not the intention?"
            ],
            "links": []
        },
        {
            "name": "Christmas, Tradition, and Our Culture",
            "date": "12/21/2023",
            "contents": [
                "The angel Gabriel: Luke 1:26-38",
                "Q: What stands out to you about Mary?",
                "Q: What does Mary teach us?",
                "We then have the story of the birth of Jesus, assuming we know it, I will act as if we have read it.",
                "What is Christmas mean to you?",
                "What is important about Christmas?",
                "Why does our society celebrate Christmas?",
                "Mark 15:22-32"
            ],
            "links": []
        },
        {
            "name": "Protecting others, self defense, and Exercise",
            "date": "01/04/2024",
            "contents": [
                "Q: What are some of the gifts that we as men have?",
                "Exercise and the gifts of being a man:",
                "We believe as Catholics that we are each given specific skills/gifts/talents/leanings that we ought to use to honor God.",
                "When someone gives you a gift, you honor them by recieving it well and caring for it.",
                "We are to offer our bodies as a living sacrifice. Women sacrifice their body with Children (rearing of children).", 
                "It is a natural outlet for them to give of themselves for another.",
                "Q: Why do you exercise?",
                "What are good reasons to exercise?",
                "Equipping yourself for the tasks and emergencies life provides.",
                "Protecting others: What ought to be protected? (purity, health, love, the vulnerable, our emotional closeness with women, those entrusted to us.)",
                "1 Corinthians 6:19",
                "Scripture: 1 Timothy 5",
                "Killing and harming others are paradigmatic wrongs. And yet there is at least one intuitive exception to this prohibition narely, killing or harming in self-defense, or in defense of others. Consider: Murder: Attacker is culpably trying to kill Victim because he is jealous of Victim's success. Victim can save his own life only by lethally throwing a grenade at Attacker. With the exception of strict pacifists, there is broad consensus in morality and law that defensive harm can be permissible in cases like this.",
                "\"They will lay their hands on you and persecute you, delivering you up to the synagogues and prisons,\nand you will be brought before kings and governors for my name's sake.\nThis will be your opportunity to bear witness.\n• You will be delivered up even by parents and brothers and relatives and friends,\nand some of you they will put to death. You will be hated by all for my name's sake.\nBut not a hair of your head will perish. By your endurance you will gain your lives.\" (Luke 21:12-13, 16-19)\n\"Do not fear those who kill the body but cannot kill the soul. Rather fear him who can destroy both soul and body in hell.\" (Matthew 10:28)\n\"You have heard that it was said, 'An eye for an eye and a tooth for a tooth.' But I say to you, Do not resist the one who is evil. But if anyone slaps you on the right cheek, turn to him the other also.\" (Mattt\n\"Love your enemies and pray for those who persecute you,\nso that you may be sons of your Father who is in heaven.\nFor he makes his sun rise on the evil and on the good, and sends rain on the just and on the unjust.\" (Matthew 5:44-45)",
                "Does defending oneself change if it's just you vs many other?"
            ],
            "links": [
                {
                    "text": "Arming oneself",
                    "url": "https://www.desiringgod.org/articles/should-christians-be-encouraged-to-arm-themselves"
                },
                {
                    "text": "Self-defense, philosphical stances",
                    "url": "https://plato.stanford.edu/entries/self-defense/"
                }
            ]
        },
        {
            "name": "Love, with and without hardship",
            "date": "01/11/2024",
            "contents": [
                "Mark 12:28-34",
                "Why do we have this obsession with love?",
                "Psychological basis for love",
                "Link 1",
                "Q: Who in your life has loved you well?",
                "St. Augustine: What is perfection in love? Love your enemies in such a way that you would desire to make them your brothers ... For so did He love, Who hanging on the Cross, said 'Father, forgive them, for they know not what they do.' (Luke 23:34)",
                "Scripture: 1 Peter 4:1-11 - Above all, keep loving one another earnestly, since love covers a multitude of sins.",
                "What does the phrase, 'Love covers a multitude of sins' mean?",
                "Scripture: Matthew 5:43-48",
                "Who do you speak of as enemies?",
                "Bonus for the men: Scripture: Ephesians 5:25: Husbands, love your wives, even as Christ loved the church and handed himself over for her"
            ],
            "links": [
                {
                    "text": "1986: Love: Psychlogical",
                    "url": "https://en.wikipedia.org/wiki/Triangular_theory_of_love"
                },
                {
                    "text": "Pope Francis on Love",
                    "url": "https://www.usccb.org/news/2023/do-you-cry-pope-asks-800000-young-people-wyd-so-does-jesus-he-says"
                }
            ]
        },
        {
            "name": "Relationships/Dating",
            "date": "01/18/2024",
            "contents": [
                "Q why do we date? What is it's purpose?",
                "Ephesians 5:25-29 - What are we as men aiming at?",
                "Vows: (Name) and (name), have you come here to enter into Marriage without coercion, freely and wholeheartedly?",
                "Are you prepared, as you follow the path of Marriage, to love and honor each other for as long as you both shall live?" ,                      
                "Are you prepared to accept children lovingly from God and to bring them up according to the law of Christ and his Church?",
                "1 Corinthians 13:4–8a - What is love?",
                "Intentionality",
                "Do you deserve love? (a very common thing people say nowadays). Yes from God, ideally yes from others, but romantic love, no you are not entitled to it.",
                "Story of Liam",
                "Are you a man worthy of the kind of woman you want?",
                "Service",
                "What should the focus be early on?",
                "Does talking go well, is it easy?",
                "Do you share the same values?",
                "Is there a kinship.",
                "Question Time!"
            ],
            "links": [
            ]
        },
        {
            "name": "Paul the Apostle: Pt 1",
            "date": "01/25/2024",
            "contents": "study-paul-acts",
            "links": []
        },
        {
            "name": "Paul the Apostle: Pt 2",
            "date": "02/01/2024",
            "contents": "study-paul-acts-2",
            "links": []
        }
    ]
}